#ifndef STREAMWRITER_H
#define STREAMWRITER_H

//////////////////////////////////////////////////////////////////////////////////////////
//---------------------------ПОДКЛЮЧЕНИЕ ЗАГОЛОВОЧНЫХ ФАЙЛОВ----------------------------//
//////////////////////////////////////////////////////////////////////////////////////////
#include <fstream>
#include <iostream>

//////////////////////////////////////////////////////////////////////////////////////////
//---------------------------ОПРЕДЕЛЕНИЕ КЛАССОВ----------------------------------------//
//////////////////////////////////////////////////////////////////////////////////////////

//**************************************************************************************//
//---------------------------класс потока записи----------------------------------------//
class StreamWriter
{
public:
	//----------------------------------------------------------------------------------//
	//----------------------------публичные методы--------------------------------------//
	//----------------------------------------------------------------------------------//
    StreamWriter(std::string fileName);													// конструктор
    ~StreamWriter();																	// деконструктор

    bool openStream();																	// открыть поток
    void closeStream();																	// закрыть поток

    void writeAtomSize(uint32_t size);													// записать размер атом
    void writeAtomName(uint32_t name);													// записать имя атома
    void writeAtomName(std::string name);												// записать имя атома
    void writeUInt32(uint32_t data);													// записать 4 байта
    void writeLitToBigEndian(uint32_t data);											// записать данные в BigEndian
    void write(uint8_t * buf, uint64_t length);											// записать массив данных

private:
	//----------------------------------------------------------------------------------//
	//----------------------------приватные атрибуты------------------------------------//
	//----------------------------------------------------------------------------------//
    std::ofstream m_file;																// "доступ" к файлу для записи
    std::string m_filePath;																// путь к файлу
};

#endif // STREAMWRITER_H
